<template>
  <div class="container">
    <Header/>
  </div>
    <div class="container">
    <h1 style="text-align: center; margin: 30px 0;">Вопросы и ответы</h1>
    <div class="faq__menu-and-accord">
    <ul class="faq__menu">
      <li class="faq__menu__item " :class="{'faq__active-menu': activeMenu == 1}" @click="activeMenu = 1">Перевозка багажа</li>
      <li class="faq__menu__item" :class="{'faq__active-menu': activeMenu == 2}" @click="activeMenu = 2">Проезд с детьми</li>
      <li class="faq__menu__item" :class="{'faq__active-menu': activeMenu == 3}" @click="activeMenu = 3">Провоз животных</li>
      <li class="faq__menu__item" :class="{'faq__active-menu': activeMenu == 4}" @click="activeMenu = 4">Отчеты за командировку</li>
      <li class="faq__menu__item" :class="{'faq__active-menu': activeMenu == 5}" @click="activeMenu = 5">Cбор персональных данных</li>
      <li class="faq__menu__item" :class="{'faq__active-menu': activeMenu == 6}" @click="activeMenu = 6">Условия возврата</li>
    </ul>
    <div class="accordion-wrapper">
      <div v-show="activeMenu == 1">
        <h4 class="header">Перевозка багажа</h4>
        <p> <strong>Пассажир имеет право</strong> провозить с собой в автобусах междугородных маршрутов:</p>
        <ul>
          <li>бесплатно - одно место ручной клади, длина, высота и ширина которого в сумме не должна превышать 120 см., в том числе мелких животных и птиц в клетках, одну пару лыж в чехле, детские санки, детскую коляску;</li>
          <li>за плату в багажном отделении транспортного средства багаж в количестве не более двух мест, длина, ширина и высота каждого из которых в сумме не превышают 180 см.</li>
        </ul>
        <p> <strong>Запрещается перевозить:</strong></p>
        <ul>
          <li>зловонные и опасные (легковоспламеняющиеся, взрывчатые, токсичные, коррозионные и др.) вещества;</li>
          <li>холодное и огнестрельное оружие без чехлов и упаковки;</li>
          <li>предметы и вещи, загрязняющие подвижной состав или одежду пассажиров;</li>
        </ul>
        <p>Тара и упаковка должны обеспечивать целостность и сохранность багажа в течение всего периода перевозки.</p>
        <p> <strong>Перевозчик вправе:</strong></p>
        <ol>
          <li>устанавливать нормы перевозки багажа, провоза ручной клади, в том числе бесплатно, большего размера или в большем количестве</li>
          <li>отказать пассажиру в принятии багажа для перевозки, провозе ручной клади, если свойства или упаковка вещей, входящих в состав багажа, ручной клади, не отвечают требованиям, установленным правилами перевозок пассажиров;</li>
          <li>отказать пассажиру в провозе ручной клади, если ее размещение в транспортном средстве будет препятствовать входу пассажиров в транспортное средство, выходу пассажиров из транспортного средства.</li>
        </ol>
        <p> <strong>категорически запрещается:</strong></p>
        <ul>
          <li>перевозить багаж, если его не сопровождает владелец;</li>
          <li>брать у граждан коробки, сумки, бандероли, любые другие предметы для перевозки в автобусе, в целях передачи их в других городах.</li>
        </ul>
      </div>
      <div v-show="activeMenu == 2">
        <h4>Проезд с детьми</h4>
        <p>Внимание! Для автовокзала Улан-Удэ возможность покупки детского билета отсутствует! </p>
        <p>Электронные билеты являются именными документами, оформляются на основании документа, удостоверяющего личность пассажира в соответствии с законодательством Российской Федерации. Для детей в возрасте до 14 лет документом, удостоверяющем личность, является свидетельство о рождении.</p>
        <p>При проезде в пределах Российской Федерации лицом, сопровождающим ребёнка в поездке, может быть любой человек. Если рейс международный, то на границе потребуется доверенность на сопровождение ребёнка. Более детальную информацию можно получить в справочной автовокзала.</p>
        <p>Cамостоятельный проезд на междугородных рейсах без сопровождения взрослых возможен с 14 лет (с момента получения паспорта). Согласно ГК РФ ребенок до 14 лет считается малолетним и не имеет права на заключение сделок на перевозку пассажиров.</p>
        <p>УСТАВ АВТОМОБИЛЬНОГО ТРАНСПОРТА И ГОРОДСКОГО НАЗЕМНОГО ЭЛЕКТРИЧЕСКОГО ТРАНСПОРТА</p>
        <p>ФЕДЕРАЛЬНЫЙ ЗАКОН N 259 от 8 ноября 2007 года </p>
        <p>Статья 21. Перевозки детей, Следующих вместе с пассажиром </p>
        <p>1. При проезде в транспортном средстве, осуществляющем регулярные перевозки пассажиров и багажа, пассажир имеет право:</p>
        <p>1) Перевозить с собой бесплатно на городском и пригородном сообщении детей в возрасте не старше семи лет без предоставления отдельных мест для сидения, за исключением случаев, предусмотренных частью 2 настоящей статьи;</p>
        <p>2) Перевозить с собой бесплатно в междугородном сообщении одного ребенка в возрасте не старше 5 лет без предоставления отдельного места для сидения, за исключением случаем, предусмотренных частью 2 настоящей статьи. </p>
        <p>2. В случаях, если в установленном порядке запрещена перевозка в транспортных средствах детей без предоставления им отдельных мест сидения, пассажир имеет право перевезти с собой двух детей в возрасте не старше 12 лет с предоставлением им отдельных мест для сидения за плату, размер которой не может составлять более чем 50% провозной платы.  </p>
        <p>3. Пассажир обязан иметь при себе документ, который подтверждает возраст ребенка, перевозимого с предоставление преимуществ поп провозной плате, указанных в частях 1 и 2 настоящей статьи, и который в обязанном порядке предъявляется по первому требованию лиц, осуществляющих контроль за платой проезда.</p>
      </div>
      <div v-show="activeMenu == 3">
        <h4>Провоз животных</h4>
        <p>Постановление Правительства РФ от 14.02.2009г. № 112 «Об утверждении Правил перевозок пассажиров и багажа автомобильным транспортом и городским наземным электрическим транспортом»:</p>
        <p>Статья 62. <strong>Допускается</strong> провоз в составе <strong>ручной клади</strong> животных и птиц в клетках с глухим дном (корзинах, коробках, контейнерах и др.), если размеры указанных клеток (корзинах, коробках, контейнерах и др.) отвечают требованиям, предусмотренным пунктом 56 настоящих Правил. Пункт 56.: Нормы провоза ручной клади и багажа, в том числе бесплатного, устанавливаются перевозчиком с учётом требований, предусмотренных статьёй 22 ФЗ «Устав автомобильного транспорта и городского наземного электрического транспорта» №259-ФЗ от 08.11.2007г., пункт 1.2: провозить с собой бесплатно <strong>ручную кладь</strong> в количестве не более одного места, длина, ширина и высота которого в сумме не превышают сто двадцать сантиметров, одну пару лыж в чехле, детские санки, детскую коляску.</p>
        <p>Статья 21.1: <strong>Перевозка и особенности обслуживания пассажиров из числа инвалидов,</strong> пункт 2: Допуск <strong>собаки-проводника,</strong> при наличии документа, подтверждающего специальное её обучение и выдаваемое по форме и в порядке, которые определяются федеральным органом исполнительной власти, осуществляющим функции по выработке и реализации государственной политики и нормативно-правовому регулированию в сфере социальной защиты населения (далее – специальный документ).</p>
      </div>
      <div v-show="activeMenu == 4">
        <h4>Отчёты за командировку</h4>
        <p>Согласно Письму Минфина России от 05.02.2010 № 03-03-05/1 при приобретении работником билета, оформленного в бездокументарной форме, - электронной маршрутной квитанции электронного пассажирского билета (электронного билета) для поездок на территории Российской Федерации и за рубеж подтверждающими документами являются в части:</p>
        <p>а) произведенных расходов по оплате:</p>
        <p>- чек контрольно-кассовой техники;<br/>
- слипы, чеки электронных терминалов при проведении операций с использованием банковской карты, держателем которой является работник;<br/>
- подтверждение кредитным учреждением, в котором открыт работнику банковский счет, предусматривающий совершение операций с использованием банковской карты, проведенной операции по оплате электронного авиабилета;<br/>
- или другой документ, подтверждающий произведенную оплату перевозки, оформленный на утвержденном бланке строгой отчетности;</p>
        <p>б) факта произведенной перевозки:</p>
        <p>- распечатка электронного документа<br/>
- электронная маршрутная квитанция электронного пассажирского билета (электронного билета) на бумажном носителе с одновременным представлением посадочного талона, подтверждающего поездку подотчетного лица по указанному в электронном билете маршруту.<br/>
- Ранее в Письме Министерства Финансов РФ от 17.07.2007г № 03-03-06/4/99 указывалось, что для признания расходов в целях налогообложения прибыли может использоваться распечатка электронного документа (маршрутная квитанция) на бумажном носителе.</p>
        <p>Маршрутная квитанция (электронный билет) доступна для загрузки с нашего сайта в разделе "Мои билеты" после получения подтверждения об оплате.</p>
        <p>Непосредственно перед посадкой необходимо обратиться в справочное окно автовокзала и попросить поставить на маршрутной квитанции печать.</p>
      </div>
      <div v-show="activeMenu == 5">
        <h4>На каком основании на сайте производится сбор персональных данных</h4>
        <p>Согласно статье 6 закона "О персональных данных", обработка персональных данных может осуществляться с согласия субъектов персональных данных. Согласие субъекта персональных данных не требуется, если обработка персональных данных осуществляется в целях исполнения договора, одной из сторон которого является субъект персональных данных. Регистрируясь на нашем сайте, вы, тем самым, соглашаетесь на хранение и обработку Ваших персональных данных. Покупая билет, вы подтверждаете публичную оферту по заключению договора перевозки пассажиров, указанных в заказе.</p>
        <p>Согласно статье 11 закона № 16-ФЗ "О транспортной безопасности" от 9 февраля 2007 года при оформлении проездных документов (билетов) передаче в автоматизированные централизованные базы персональных данных о пассажирах подлежат следующие данные:</p>
        <p>- фамилия, имя, отчество</p>
        <p>- дата и место рождения</p>
        <p>- вид и номер документа, удостоверяющего личность, по которому приобретается проездной документ (билет)</p>
        <p>- пункт отправления, пункт назначения, вид маршрута следования</p>
        <p>- дата поездки</p>
        <p>Приказом № 116 Министерства транспорта Российской Федерации от 18 мая 2010 г регламентируется форма электронного многоцелевого документа. Наличие электронного стоимостного купона и квитанции является обязательным. Электронный многоцелевой документ должен, помимо прочего, включать сведения о пассажире/лице, оплатившем услугу, номер документа, к которому оформляется электронный многоцелевой документ.</p>
      </div>
      <div v-show="activeMenu == 6">
        <h3 class="main__conditions-title" style="margin-top: 0;">Возврат билетов</h3>
        <p>Согласно статье 23 Устава автомобильного транспорта от 8 ноября 2007 г. при срыве рейса по техническим причинам или задержке рейса более чем на час, возврат стоимости проезда производится в полном объеме. </p> 
        <p>Если возврат билета инициирует пассажир, то производятся следующие удержания из возвращаемой стоимости проезда:</p>
        <ol>
            <li>Возврат билета более чем за 2 часа до отправления - 5%</li>
            <li>Возврат билета в течение 2 часов до отправления - 15%</li>
            <li>Возврат билета в течение 3 часов после отправления - 25%</li>
            <li>Через 3 часа после отправления автобуса возврат денег за билет не производится.</li>
        </ol>    

        <p class="main__conditions-descr">Помимо удержаний (согласно статье 23 Устава) возврату не подлежит агентский сбор за услугу Интернет продажи, комиссионный сбор автовокзала за предварительную продажу (когда таковая имеется), а также возможные комиссионные сборы платежных систем, с помощью которых пользователь осуществил оплату.</p>
        

        <h3 class="main__conditions-title">Возврат билетов на сайте</h3>
        <p class="main__conditions-descr">Для возврата электронного билета через сайт, необходимо на странице «Мои поездки», выбрав нужный заказ, нажать на кнопку «Ещё» и выбрать «Вернуть билет». Далее в предложенном списке выбрать нужный билет и нажать «Вернуть билет». Сумма возврата рассчитывается автоматически, исходя из даты отправления и текущего статуса рейса.</p>
        <p class="main__conditions-descr">До отправления возврат можно произвести за 15 минут до непосредственной отправки.<br>
          После отправления возврат возможен через 30 минут после (но не позже 3 часов) после отправления.
        </p>
      </div>
      
      
    </div>
    </div>
  </div>
  <hr class="bef__footer">
    <Footer/>
</template>
<script>
  import AccordionItem from '../components/AccordionItem.vue';
  import Header from '../components/Header.vue';
  import Footer from '../components/Footer.vue'

  export default
  {
    components:{AccordionItem, Header, Footer},
    data(){
      return{
        activeMenu:1,
        AccordItem:{
          raceItem:[
             {
                id:1,
                header:'Какие рейсы есть?',
                text:'Любые есть' ,
                open: false
            },
            {
                id:2,
                header:'Какие рейсы есть?',
                text:'Любые есть' ,
                open: false
            },
            {
                id:3,
                header:'Какие рейсы есть?',
                text:'Любые есть' ,
                open: false
            },
          ],
          covid:[
            {
                id:4,
                header:'какой ковид есть',
                text:'Любой есть' ,
                open: false
            }
          ],
          td:[
            {
                id:5,
                header:'какой тд есть',
                text:'Любые есть' ,
                open: false
            }
          ]
         
       
        }
      }
    }
  }
</script>
<style>

/* Accordion */
.input-accord {
    position: absolute;
    opacity: 0;
    z-index: -1;
}
.accordion-wrapper {
    border-radius: 8px;
    overflow: hidden;
    box-shadow: 0 2px 4px rgb(0 0 0 / 15%);
    width: 700px;
    margin:0 auto;
    background-color: white;
    padding: 40px;
}
.accordion-wrapper p, .accordion-wrapper li{
  margin-bottom: 10px;
}
.accordion-wrapper ul li{
  list-style-type: disc;
}
.accordion-wrapper ol li{
  list-style-type: decimal;
}
.accordion-wrapper ol, .accordion-wrapper ul{
  padding-left: 1rem;
}
.accordion-wrapper{
  list-style-type: disc;
}
.accordion {
    width: 100%;
    overflow: hidden;
}
.accordion:last-child{
    margin-bottom: 0;
}
.accordion-label {
    display: flex;
    -webkit-box-pack: justify;
    justify-content: space-between;
    padding: 16px;
    padding-left: 0px;
    font-weight: bold;
    cursor: pointer;
    font-size: 20px;
    font-size: 17px;
    font-weight: 400;
}
.accordion-label::after {
    content: "\276F";
    width: 16px;
    height: 16px;
    text-align: center;
    color: var(--blue);

}
/* .accordion-wrapper .animation-enter-active {
  height: 100px !important;
  transition: all 1s ease !important;
  overflow: hidden !important;
}

.accordion-wrapper .animation-leave-active {
  height: 100px !important;
  transition: all 1s ease !important;
  overflow: hidden !important;
} */
.accordion-content {
    height: 40px;
    padding: 0 6px;
    background: white;
    overflow: auto;
    /* -webkit-transition: all 0.3s;
    transition: all 0.3s; */
}
.accordion-content p{
    margin: 0;
    font-size: 14px;
}
/* input:checked + .accordion-label::after {
    -webkit-transform: rotate(90deg);
    transform: rotate(90deg);
}
input:checked ~ .accordion-label {
   color: var(--blue);
}
input:checked ~ .accordion-content {
    max-height: 100vh;
    padding: 16px;
} */
/* menu */
.faq__menu
{
  display: flex;
  flex-direction: column;
}
.faq__menu__item
{
  padding: 10px;
  border-left: 2px solid rgb(192, 192, 192);
}
.faq__menu-and-accord
{
  display: flex;
}
.faq__active-menu
{
  border-left: 2px solid var(--blue);
  font-weight: bold;
}
.faq__menu__item 
{
  cursor: pointer;
}
@media (min-width: 320px) and (max-width: 768px){
  .faq__menu-and-accord{
    flex-direction: column;
  } 
  .accordion-wrapper{
    max-width: 100%;
    padding: 20px;
    margin-top: 15px;
  }
}
  
</style>