<template>

<div class="container">
<Header/>
<div class="main__conditions">
    <h3 class="main__conditions-title">Возврат билетов</h3>
    <p>Согласно статье 23 Устава автомобильного транспорта от 8 ноября 2007 г. при срыве рейса по техническим причинам или задержке рейса более чем на час, возврат стоимости проезда производится в полном объеме. </p> 
    <p>Если возврат билета инициирует пассажир, то производятся следующие удержания из возвращаемой стоимости проезда:</p>
    <ol>
        <li>Возврат билета более чем за 2 часа до отправления - 5%</li>
        <li>Возврат билета в течение 2 часов до отправления - 15%</li>
        <li>Возврат билета в течение 3 часов после отправления - 25%</li>
        <li>Через 3 часа после отправления автобуса возврат денег за билет не производится.</li>
    </ol>    

    <p class="main__conditions-descr">Помимо удержаний (согласно статье 23 Устава) возврату не подлежит агентский сбор за услугу Интернет продажи, комиссионный сбор автовокзала за предварительную продажу (когда таковая имеется), а также возможные комиссионные сборы платежных систем, с помощью которых пользователь осуществил оплату.</p>
    

    <h3 class="main__conditions-title">Возврат билетов на сайте</h3>
    <p class="main__conditions-descr">Для возврата электронного билета через сайт, необходимо на странице «Мои поездки», выбрав нужный заказ, нажать на кнопку «Ещё» и выбрать «Вернуть билет». Далее в предложенном списке выбрать нужный билет и нажать «Вернуть билет». Сумма возврата рассчитывается автоматически, исходя из даты отправления и текущего статуса рейса.</p>
    <p class="main__conditions-descr">До отправления возврат можно произвести за 15 минут до непосредственной отправки.<br>
        После отправления возврат возможен через 30 минут после (но не позже 3 часов) после отправления.</p>
    

    <!-- <h3 class="main__conditions-title">Возврат билетов на автовокзале</h3>
    <p>Для оформления возврата электронного билета на автовокзале необходимо обратиться в кассу электронных билетов на автовокзале и предъявить документ, удостоверяющий личность (паспорт) на имя пассажира, указанного в билете.<br>
    Перечисление денег покупателю будет произведено нами после получения заявления на возврат от автовокзала.</p> -->
    
</div>

</div>
<Footer/>

</template>

<style>
.main__conditions{
    padding: 20px;
    padding-top: 1px;
    margin-top: 10px;
}
.main__conditions ol{
    padding-left: 1.2rem;
    margin-top: 20px;
}
.main__conditions ol li{
    list-style-type: static;
}

.main__conditions-title{
    color: #0275fe;
    margin-top: 35px;
}
.main__conditions-descr{
    margin-top: 20px;
}

</style>

<script>
import Footer from '../components/Footer.vue'
import Header from '../components/Header.vue'

export default{
    components: {
        Header,
        Footer
    },
    data() {
        return {

        }
    },
    methods: {
        
    },
    watch: {
        
    },
    computed: {

    }
}
</script>